{"id":"40ab909e-7b56-4f64-bfd1-90067308a87a","rule_id":"c47d5acf-87c0-4a75-9ce3-47656f2bc7ac","name":"PowerShell Process Chain with Obfuscation","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":0,"updated_at":"2025-10-15T17:43:30.981Z","updated_by":"113591190","created_at":"2025-10-15T16:37:14.812Z","created_by":"113591190","enabled":false,"interval":"1m","from":"now-2m","to":"now","description":"Obfuscated PS execution","tags":[],"author":[],"license":"","threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":[],"references":[],"risk_score":73,"risk_score_mapping":[],"severity":"high","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"meta":{"kibana_siem_app_url":"https://my-security-project-b54c7f.kb.us-central1.gcp.elastic.cloud/app/security"},"type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.code: \"1\"  AND winlog.channel: \"Microsoft-Windows-Sysmon/Operational\" AND process.name: \"powershell.exe\" AND process.parent.name: \"powershell.exe\" AND process.command_line: (*-EncodedCommand* OR *-enc* OR *-e*)","filters":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
