{"id":"30684b27-de19-4410-ac73-265a9e87f464","rule_id":"681e7434-c8a5-41d1-b1e2-a1ba67c4fe18","name":"Reg.exe Used for Persistence Creation","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":0,"updated_at":"2025-10-15T17:43:29.430Z","updated_by":"113591190","created_at":"2025-10-15T16:56:58.034Z","created_by":"113591190","enabled":false,"interval":"1m","from":"now-2m","to":"now","description":"Detecting Attempt for Persistence","tags":[],"author":[],"license":"","threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":[],"references":[],"risk_score":73,"risk_score_mapping":[],"severity":"high","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"meta":{"kibana_siem_app_url":"https://my-security-project-b54c7f.kb.us-central1.gcp.elastic.cloud/app/security"},"type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.code: \"1\" \nAND winlog.channel: \"Microsoft-Windows-Sysmon/Operational\"\nAND process.name: \"reg.exe\"\nAND process.command_line: (*add* AND *CurrentVersion\\\\Run* AND */d*)","filters":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
